[{"categories":[],"date":"0001-01-01T00:00:00Z","description":"","keywords":null,"link":"/proceedings/","tags":[],"text":" We are delighted to share that the proceedings of the AIDEA Symposium have now been published! This collection brings together the diverse and inspiring contributions presented at the event, reflecting the latest developments and insights in the field. We are excited for you to explore the work of our community and hope it will serve as a valuable resource for your research and practice. You can find the individual papers on OpenReview. Alternatively, you can download a ZIP file with all contributions from our website: Download proceedings as ZIP file","title":"Proceedings"},{"categories":[],"date":"0001-01-01T00:00:00Z","description":"","keywords":null,"link":"/location/","tags":[],"text":" The symposium takes place at the KTH Royal Institute of Technology in Stockholm, Sweden. Further information on the venue will follow soon.","title":"Location"},{"categories":[],"date":"0001-01-01T00:00:00Z","description":"","keywords":null,"link":"/schedule/topics/","tags":[],"text":"The following focus topics will be addressed and discussed in various sessions: Data and Problems What data and related contextual problems are appropriate for designing learning opportunities related to AI? What do students need to know about the concept of data to do data science and understand AI? Tools Which (digital) tools are suitable or adaptable for teaching, learning and doing data science and AI at school level? Explanatory Models What kind of educational and explanatory models–on which level of detail and abstraction–are suitable for what learners? Where are black boxes suitable, or even needed, and where should they be avoided? Learning Materials How can suitable teaching and learning materials look like? Which concepts can be elementarised? What are good practice examples? AI and Data Science Competencies What are key competencies that responsible citizens should acquire regarding the field of AI and data science? Which AI and data science competencies should already be promoted at school? What contribution can and must different subjects make? AI and Data Science Curricula and Implementation in School How can AI education be integrated in schools? How can AI and data science education be integrated into existing subject curricula (e.g. computer science, mathematics, social and natural sciences)? What could an AI and data science curriculum look like? AI and Data Science Education for Social Good How can AI and data science education (e.g. learning environment, selection of data, etc.) be designed to effectively address social issues and promote societal well-being? What ethical considerations should guide our understanding of AI and data science in teaching?","title":"Focus topics"}]